// 문제
// ***********************************************************************************************************************************************************************************
// 아래와 같이 나라 이름을 출력하고 숫자를 입력받아 해당하는 나라의 수도를 출력하는 작업을 반복하다가 해당하는 번호 이외의 숫자가 입력되면 "none"라고 출력한 후 종료하는 프로그램을 작성하시오.
// * 각 나라의 수도 : 
// 		대한민국 = 서울(Seoul)
//	 	미국 = 워싱턴(Washington)
// 		일본 = 동경(Tokyo)
// 		중국 = 북경(Beijing)
// ***********************************************************************************************************************************************************************************

// 예제 입력																		| 예제 출력
// ***********************************************************************************************************************************************************************************
// 1. Korea																		 | Seoul
// 2. USA																			 |
// 3. Japan																		 |
// 4. China																		 |
// number? 1																	 |
// ***********************************************************************************************************************************************************************************

// 시간 제한 : 1초
// 메모리 제한 : 0 MB

#include "header.h"

int main() {
	clock_t start, end;
	float res;

	start = clock();

	int num;

	while(1) {
		printf("1. Korea\n");
		printf("2. USA\n");
		printf("3. Japan\n");
		printf("4. China\n");
		printf("number? ");
		scanf("%d", &num);

		if (num == 1) {
			printf("\nSeoul\n\n");
		} else if (num == 2) {
			printf("\nWashington\n\n");
		} else if (num == 3) {
			printf("\nTokyo\n\n");
		} else if (num == 4) {
			printf("\nBeijing\n\n");
		} else {
			printf("\nnone");
			break;
		}
	}

	end = clock();
	res = (float)(end - start)/CLOCKS_PER_SEC;

	printf("\n\n소요된 시간 : %.3f \n", res);
}