#include <stdio.h>
#include <stdlib.h>
// ***********************************************************************************************************************************************************************************
// 연결 리스트에 사용할 구조체 선언
// ***********************************************************************************************************************************************************************************
typedef struct _list {
	struct _node *cur;
	// 연결 리스트 시작점
	struct _node *head;
	// 연결 리스트 끝점
	struct _node *tail;
} linkedList;

typedef struct _node {
	int data;
	struct _node *next;
} node;
// ***********************************************************************************************************************************************************************************
// linkedList 할당 부분
// 동적할당으로 선언된 *L은 최초에 어떠한 노드도 포함하고 있지 않으므로 각각의 멤버 변수를 NULL로 초기화 해주는 작업이 필요
// ***********************************************************************************************************************************************************************************
int main(void) {
	// linkedList pointer define start
	linkedList *L = (linkedList *)malloc(sizeof(linkedList));
	L->cur = NULL;
	L->head = NULL;
	L->tail = NULL;
	// linkedList pointer define end
}
// ***********************************************************************************************************************************************************************************
// insert 함수 선언 부분
// 새로운 노드(newNode)를 node구조체의 포인터 변수로 생성하고 현재 연결리스트(L)에 붙이는 함수
// ***********************************************************************************************************************************************************************************
void createNode(linkedList *L, int tdata) {
	node *newNode = (node *)malloc(sizeof(node));
	newNode->data = tdata;
	newNode->next = NULL;
	if(L->head == NULL && L->tail == NULL)
		L->head = L->tail = newNode;
	else {
		L->tail->next = newNode;
		L->tail = newNode;
	}
}
// ***********************************************************************************************************************************************************************************
// delete 함수 선언 부분
// 첫 노드(L->head)부터 끝 노드(p->next == NULL)의 전 노드(p->next->next == NULL)까지 간 다음 그 노드의 next를 NULL로 만들어 버림.
// ***********************************************************************************************************************************************************************************
void deleteLastNode(linkedList *L) {
	node *p = L->head;
	while(p->next->next != NULL) p = p->next;
	p->next = p->next->next;
	L->tail = p;
}